appName = SubMerge

signIn = Se connecter
signIn.username = Utilisateur
signIn.password = Mot de passe
signIn.remember = Rester connecter
signIn.login = Connexion

language = Langue
language.french = Fran\u00e7ais
language.english = Anglais
language.chinese = Chinois

index = Accueil
index.warningRegister = <strong>Cr\u00e9ez un compte</strong> pour d\u00e9finir et sauvegarder des profils
index.topSubtitle = Sous-titre du haut
index.bottomSubtitle = Sous-titre du bas
index.outputFile = Fichier de sortie
index.download = T\u00e9l\u00e9charger
index.choose = S\u00e9lectionner

about = A propos
about.submerge = A propos de SubMerge
about.howto.question = Comment Submerge fonctionne-t-il ?
about.howto.answer = Uploadez deux sous-titres, Submerge g\u00e9n\u00e8re un fichier SSA/ASS mis en forme affichant les deux simultan\u00e9ment : l'un en haut de l'\u00e9cran, l'autre en bas.
about.encoding.question = Quels sonts les formats de sous-titres support\u00e9s ?
about.encoding.answer = Submerge accepte en entr\u00e9e les formats SRT et SSA/ASS et d\u00e9tecte automatiquement leur encodage de caract\u00e8res. Le fichier g\u00e9n\u00e9r\u00e9 est quant \u00e0 lui au format ASS encod\u00e9 en UTF-8.
about.fonts.question = Changer la police n'a pas d'effet
about.fonts.answer = La plupart des lecteurs modernes acceptent la mise en forme ASS, cependant les polices support\u00e9es sont souvent peu nombreuses.	\
					 Dans le cas o\u00f9 la vid\u00e9o est lue depuis un ordinateur, il est tout \u00e0 fait possible d'en t\u00e9l\u00e9charger et installer de nouvelles \
					 (\u00e0 noter qu'il en va de m\u00eame pour la fonctionnalit\u00e9 de pr\u00e9visualisation sur le site puisqu'elle se base sur les polices du syst\u00e8me).
about.contact = Contact
about.contact.me = Le code source est disponible sur github, n'h\u00e9sitez pas contribuer et/ou signaler les bugs et demandes d'\u00e9volutions sur le \
				   bugtracker. Pour tout autre question, ou si vous souhaitez simplement traduire le site dans votre langue maternelle, vous pouvez \
				   me contacter par mail.
about.contact.at = Contact :
about.contact.sourcesAt = Code source :

logout = Se d\u00e9connecter

signUpOrLogin = Cr\u00e9er un compte / Se  connecter
signUp = Cr\u00e9er un compte
signUp.username = Pseudo
signUp.password = Mot de passe
signUp.passwordConfirm = Confirmer le mot de passe
signUp.email = E-mail
signUp.register = S'enregistrer

footer.viewOnGithub = Voir le code source sur GitHub

sub.fontname = Police
sub.fontname.mustBeInstalled = La police doit \u00eatre install\u00e9e sur l'ordinateur
sub.fontsize = Taille
sub.color = Couleur
sub.outlineColor = Couleur du contour
sub.outline = Taille du contour
sub.filename = Nom du fichier
sub.invalid = Fichier invalide
sub.empty = Veuillez s\u00e9lectionner un fichier de sous-titres
sub.preview = Portez ce vieux whisky au juge blond qui fume

validator.requiredField = Champ obligatoire
validator.exists.email = Cette adresse est d\u00e9j\u00e0 utilis\u00e9e
validator.exists.username = Ce pseudo est d\u00e9j\u00e0 utilis\u00e9
validator.invalid.email = Format invalide
validator.invalid.username = Le nom d'utilisateur ne peut contenir que lettres et chiffres, sans espace, et doit \u00eatre compris entre 5 et 20 caract\u00e8res 
validator.invalid.password = Le mot de passe doit \u00eatre compris entre 5 et 50 caract\u00e8res 
validator.notsame.password = Le mot de passe et la confirmation nes sont pas identiques
validator.invalid.usernameOrPassword = Nom d'utilisateur ou mot de passe incorrect
validator.invalid.color = Code couleur invalide

error.unexpected = Une erreur innatendue est survenue