appName = SubMerge

signIn = Se connecter
signIn.username = Utilisateur
signIn.password = Mot de passe
signIn.remember = Rester connecter
signIn.login = Connexion

language = Langue
language.french = Fran\u00e7ais
language.english = Anglais
language.chinese = Chinois

index = Accueil
index.warningRegister = Cr\u00e9ez un compte pour sauvegarder vos param\u00e8tres
index.howToSaveSettings = Vos param\u00e8tres sont sauvegard\u00e9s \u00e0 chaque nouvelle g\u00e9n\u00e9ration de sous-titres
index.subOne = Premier sous-titre
index.subTwo = Second sous-titre
index.outputFile = Fichier de sortie
index.download = T\u00e9l\u00e9charger
index.choose = S\u00e9lectionner
index.position = Position

about = A propos
about.submerge = A propos de SubMerge
about.howto.question = Comment Submerge fonctionne-t-il ?
about.howto.answer = Uploadez deux sous-titres, Submerge g\u00e9n\u00e8re un fichier SSA/ASS mis en forme affichant les deux simultan\u00e9ment : l'un en haut de l'\u00e9cran, l'autre en bas.
about.encoding.question = Quels sonts les formats de sous-titres support\u00e9s ?
about.encoding.answer = Submerge accepte en entr\u00e9e les formats SRT et SSA/ASS et d\u00e9tecte automatiquement leur encodage de caract\u00e8res. Le fichier g\u00e9n\u00e9r\u00e9 est quant \u00e0 lui au format ASS encod\u00e9 en UTF-8.
about.fonts.question = Changer la police n'a pas d'effet
about.fonts.answer = La plupart des lecteurs modernes acceptent la mise en forme ASS, cependant les polices support\u00e9es sont souvent peu nombreuses.	\
					 Dans le cas o\u00f9 la vid\u00e9o est lue depuis un ordinateur, il est tout \u00e0 fait possible d'en t\u00e9l\u00e9charger et installer de nouvelles \
					 (\u00e0 noter qu'il en va de m\u00eame pour la fonctionnalit\u00e9 de pr\u00e9visualisation sur le site puisqu'elle se base sur les polices du syst\u00e8me).
about.contact = Contact
about.contact.me = Le code source est disponible sur github, n'h\u00e9sitez pas contribuer et/ou signaler les bugs et demandes d'\u00e9volutions sur le \
				   bugtracker. Pour tout autre question, ou si vous souhaitez simplement traduire le site dans votre langue maternelle, vous pouvez \
				   me contacter par mail.
about.contact.at = Contact :
about.contact.sourcesAt = Code source :

logout = Se d\u00e9connecter

signUpOrLogin = Cr\u00e9er un compte / Se  connecter
signUp = Cr\u00e9er un compte
signUp.username = Pseudo
signUp.password = Mot de passe
signUp.passwordConfirm = Confirmer le mot de passe
signUp.email = E-mail
signUp.register = S'enregistrer

tools = Outils
tools.convert = Convertir
tools.choose = S\u00e9lectionner
tools.convertutf8 = Conversion vers UTF-8
tools.convertutf8.explanation = D\u00e9tecte l'encodage de caract\u00e8re et converti le fichier en UTF-8
tools.convertsrt = Conversion vers SRT
tools.convertsrt.explanation = Converti un fichier SSA/ASS au format SRT
tools.convertass = Conversion vers ASS
tools.convertass.explanation = Converti un fichier SRT / ASS en ASS formatt\u00e9
tools.cli = Application bureau
tools.appli.description = SubMerge peut \u00e9galement s'utiliser via son application de bureau (utilisation en ligne de commandes) :
tools.appli.download = T\u00e9l\u00e9charger submerge-cli
tools.appli.howToUse = D\u00e9couvrir comment s'utilise submerge-cli

subcli.downloadPage = Le fichier jar peut \u00eatre t\u00e9l\u00e9charg\u00e9 
subcli.downloadLink = ici
subcli.example = Exemple :
subcli.basicUse = Installation
subcli.basicUse.intro = submerge-cli est une application utilisable en ligne de commande proposant les m\u00eames fonctionnalit\u00e9s que le site : merge de 2 sous-titres en 1, modification de l'encodage de caract\u00e8re d'un fichier, g\u00e9n\u00e9ration de sous-titres ASS et conversion en SRT.
subcli.basicUse.jre.message = L'application est d\u00e9velopp\u00e9e en java. Elle est donc compatible linux / Mac / Windows mais requiert l'installation de 
subcli.basicUse.jre.link = Java Runtime Environment 8
subcli.basicUse.jre.version.windows = Pour conna\u00eetre sa version de java (windows) :
subcli.basicUse.jre.version.linux = Sous linux :
subcli.basicUse.jre.version.go = Si la version de java est ant\u00e9rieure \u00e0 8, il faut proc\u00e9der \u00e0 la mise \u00e0 jour. L'utilisation de submerge-cli ne requiert pas d'autre manipulation et il suffit alors d'ouvrir un terminal dans le dossier du jar et de tapper la commande d\u00e9sir\u00e9e. Par exemple afficher l'aide :
subcli.basicUse.linux.command = Pour transformer l'utilisation du jar en une commande syst\u00e8me (exemple ici sous linux), cr\u00e9er un fichier stub.sh dans le m\u00eame r\u00e9pertoire que le jar contenant le code suivant :
subcli.basicUse.createStub = Puis ex\u00e9cuter les commandes suivantes :
subcli.basicUse.example = D\u00e9sormais submerge peut \u00eatre lanc\u00e9 comme n'importe quelle commande (ici nomm\u00e9e sbm) :
subcli.merge = Merge
subcli.merge.intro = La commande merge prend 2 sous-titres au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un ASS dans le r\u00e9pertoire courant. Pour personnaliser le sous-titre g\u00e9n\u00e9r\u00e9, se r\u00e9f\u00e9rer \u00e0 l'onglet configuration.
subcli.merge.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output
subcli.merge.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.srt = SRT
subcli.srt.intro = La commande srt prend 2 sous-titres au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un SRT dans le r\u00e9pertoire courant. Si le sous-titre d'entr\u00e9e est un SSA / ASS alors les balises italique sont traduite en balise itaque SRT (tout autre formattage est effac\u00e9). 
subcli.srt.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output
subcli.srt.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.ass = ASS
subcli.ass.intro = La commande ass prend un sous-titre au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un ASS formatt\u00e9 dans le r\u00e9pertoire courant. Pour personnaliser le sous-titre g\u00e9n\u00e9r\u00e9, se r\u00e9f\u00e9rer \u00e0 l'onglet configuration. 
subcli.ass.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output :
subcli.ass.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.utf8 = UTF-8
subcli.utf8.intro = La commande utf8 accepte un fichier en entr\u00e9e (pas de restriction sur le format), elle en d\u00e9tecte l'encodage de caract\u00e8re et le transforme en UTF-8.
subcli.utf8.optionOutput = En l'absence d'autre param\u00e8tre, la commande utf8 modifie directement le fichier d'entr\u00e9e. Il est en cependant possible de laisser celui-ci tel quel et d'\u00e9crire le r\u00e9sultat dans un nouveau fichier via l'option --output
subcli.utf8.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.config = Configuration
subcli.config.intro = Comme le site, submerge-cli permet de configurer les param\u00e8tres les plus courants du fichier ASS g\u00e9n\u00e9r\u00e9 : couleur, police, taille et contour. Le param\u00e9trage se fait dans un fichier de configuration XML situ\u00e9 \u00e0 l'int\u00e9rieur du jar.
subcli.config.unzip = Pour le modifier, il faut donc ouvrir le jar avec un gestionnaire d'archive et modifier le fichier user-config.xml :
subcli.config.xmlfile = Celui-ci se pr\u00e9sente comme suit :
subcli.config.howtoxml = Le bloc dualAssConfig configure les param\u00e8tres utilis\u00e9s par la commande --merge tandis que le bloc simpleAssConfig configure ceux de la commande --ass. Pour chacun la configuration est similaire et les valeurs possibles de chacune des balise sont les m\u00eames que sur le site (attention \u00e0 la police qui doit respecter la casse).

footer.viewOnGithub = Voir le code source sur GitHub

sub.fontname = Police
sub.fontname.mustBeInstalled = La police doit \u00eatre install\u00e9e sur l'ordinateur
sub.fontsize = Taille
sub.color = Couleur
sub.outlineColor = Couleur du contour
sub.outline = Taille du contour
sub.filename = Nom du fichier
sub.filename.tooltip = ${one} / ${baseOne} /...  seront remplac\u00e9s par le nom de fichier
sub.invalid = Fichier invalide
sub.empty = Veuillez s\u00e9lectionner un fichier de sous-titres
sub.preview = Portez ce vieux whisky au juge blond qui fume

validator.requiredField = Champ obligatoire
validator.exists.email = Cette adresse est d\u00e9j\u00e0 utilis\u00e9e
validator.exists.username = Ce pseudo est d\u00e9j\u00e0 utilis\u00e9
validator.invalid.email = Format invalide
validator.invalid.username = Le nom d'utilisateur ne peut contenir que lettres et chiffres, sans espace, et doit \u00eatre compris entre 5 et 20 caract\u00e8res 
validator.invalid.password = Le mot de passe doit \u00eatre compris entre 5 et 50 caract\u00e8res 
validator.notsame.password = Le mot de passe et la confirmation nes sont pas identiques
validator.invalid.usernameOrPassword = Nom d'utilisateur ou mot de passe incorrect
validator.invalid.color = Code couleur invalide

error.unexpected = Une erreur innatendue est survenue

alignment.center = Centr\u00e9
alignment.left = Gauche
alignment.right = Droite
alignment.offset.top = Haut
alignment.offset.bottom = Bas

indexSettings.settings = Param\u00e8tres
indexSettings.avoidSwitch = D\u00e9tecter les permutations
indexSettings.avoidSwitchTooltip = Si le param\u00e8tre "position" est le m\u00eame pour les 2 sous-titres, alors cette option ajoutera automatiquement une marge pour \u00e9viter que ceux-ci ne permuttent leur position (au-dessus/en dessous l'un de l'autre)
indexSettings.clean = Nettoyer les sous-titres
indexSettings.cleanTooltip = Supprime la mise en forme cod\u00e9e dans les sous-titres upload\u00e9s (sauf l'italique)
indexSettings.adjustTimecodes = Ajuster les timecodes (beta)
indexSettings.adjustTimecodesTooltip = Synchronise l'apparition et la disparition des sous-titres pour lesquels les codes temporels sont proches.
indexSettings.oneLineSubtitles = Regrouper sur une ligne
indexSettings.oneLineSubtitlesTooltip = Transforme les sous-titres multi-lignes en une mono-ligne