appName = SubMerge

signIn = Sign In
signIn.username = Username
signIn.password = Password
signIn.remember = Remember me
signIn.login = Sign In

language = Language
language.french = French
language.english = English
language.chinese = Chinese

index = Home
index.warningRegister = <strong>Register an account</strong> to save your settings
index.howToSaveSettings = Click on the download button to save your settings
index.topSubtitle = Top subtitle
index.bottomSubtitle = Bottom subtitle
index.outputFile = Output file
index.download = Download
index.choose = Choose

about = About
about.submerge = About SubMerge
about.howto.question = How does it work?
about.howto.answer = Upload two subtitles, Submerge will merge them into one ASS file so they will be displayed at the same time: one at the top of the screen, the other at the bottom.
about.encoding.question = Which subtitles format are accepted?
about.encoding.answer = Submerge can merge SRT and SSA/ASS subtitles. The file generated is UTF-8 encoded SSA/ASS.
about.fonts.question = Changing the font has no effect
about.fonts.answer = Most of modern players support ASS format but they usually have quite few fonts styles.	\
					 If the video is played on a computer, additional fonts can be installed \
					 (the same goes with the site preview as it is based on the system fonts).
about.contact = Contact
about.contact.me = Source code is available on Github, do not hesitate to contribute and/or report any bugs and developments on the bugtracker. \
				   For any other questions, or if you simply want to translate the website in your native language, feel free to contact me by email.
about.contact.at = Contact at :
about.contact.sourcesAt = Sources at :

logout = Logout

signUpOrLogin = Sign Up / Login
signUp = Sign Up
signUp.username = Username
signUp.password = Password
signUp.passwordConfirm = Password (Confirm)
signUp.email = Email
signUp.register = Register

tools = Tools
tools.convert = Convert
tools.choose = Choose
tools.convertutf8 = Convert to UTF-8
tools.convertutf8.explanation = Detect the charset encoding of a file and change it to UTF-8
tools.convertsrt = Convert to SRT
tools.convertsrt.explanation = Convert a SSA/ASS subtitle to SRT
tools.convertass = Convert to ASS
tools.convertass.explanation =Convert a SRT / ASS file to a formatted ASS subtitle
tools.cli = Desktop application
tools.appli.description = SubMerge has also its own desktop (command-line) application submerge-cli.
tools.appli.download = Download submerge-cli
tools.appli.howToUse = How to use it

subcli.downloadPage = Le fichier jar peut \u00eatre t\u00e9l\u00e9charg\u00e9 
subcli.downloadLink = ici
subcli.example = Exemple :
subcli.basicUse = Installation
subcli.basicUse.intro = submerge-cli est une application utilisable en ligne de commande proposant les m\u00eames fonctionnalit\u00e9s que le site : merge de 2 sous-titres en 1, modification de l'encodage de caract\u00e8re d'un fichier, g\u00e9n\u00e9ration de sous-titres ASS et conversion en SRT.
subcli.basicUse.jre.message = L'application est d\u00e9velopp\u00e9e en java. Elle est donc compatible linux / Mac / Windows mais requiert l'installation de 
subcli.basicUse.jre.link = Java Runtime Environment 8
subcli.basicUse.jre.version.windows = Pour conna\u00eetre sa version de java (windows) :
subcli.basicUse.jre.version.linux = Sous linux :
subcli.basicUse.jre.version.go = Si la version de java est ant\u00e9rieure \u00e0 8, il faut proc\u00e9der \u00e0 la mise \u00e0 jour. L'utilisation de submerge-cli ne requiert pas d'autre manipulation et il suffit alors d'ouvrir un terminal dans le dossier du jar et de tapper la commande d\u00e9sir\u00e9e. Par exemple afficher l'aide :
subcli.basicUse.linux.command = Pour transformer l'utilisation du jar en une commande syst\u00e8me (exemple ici sous linux), cr\u00e9er un fichier stub.sh dans le m\u00eame r\u00e9pertoire que le jar contenant le code suivant :
subcli.basicUse.createStub = Puis ex\u00e9cuter les commandes suivantes :
subcli.basicUse.example = D\u00e9sormais submerge peut \u00eatre lanc\u00e9 comme n'importe quelle commande (ici nomm\u00e9e sbm) :
subcli.merge = Merge
subcli.merge.intro = La commande merge prend 2 sous-titres au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un ASS dans le r\u00e9pertoire courant. Pour personnaliser le sous-titre g\u00e9n\u00e9r\u00e9, se r\u00e9f\u00e9rer \u00e0 l'onglet configuration.
subcli.merge.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output
subcli.merge.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.srt = SRT
subcli.srt.intro = La commande srt prend 2 sous-titres au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un SRT dans le r\u00e9pertoire courant. Si le sous-titre d'entr\u00e9e est un SSA / ASS alors les balises italique sont traduite en balise itaque SRT (tout autre formattage est effac\u00e9). 
subcli.srt.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output
subcli.srt.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.ass = ASS
subcli.ass.intro = La commande ass prend un sous-titre au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un ASS formatt\u00e9 dans le r\u00e9pertoire courant. Pour personnaliser le sous-titre g\u00e9n\u00e9r\u00e9, se r\u00e9f\u00e9rer \u00e0 l'onglet configuration. 
subcli.ass.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output :
subcli.ass.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.utf8 = UTF-8
subcli.utf8.intro = La commande utf8 accepte un fichier en entr\u00e9e (pas de restriction sur le format), elle en d\u00e9tecte l'encodage de caract\u00e8re et le transforme en UTF-8.
subcli.utf8.optionOutput = En l'absence d'autre param\u00e8tre, la commande utf8 modifie directement le fichier d'entr\u00e9e. Il est en cependant possible de laisser celui-ci tel quel et d'\u00e9crire le r\u00e9sultat dans un nouveau fichier via l'option --output
subcli.utf8.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.config = Configuration
subcli.config.intro = Comme le site, submerge-cli permet de configurer les param\u00e8tres les plus courants du fichier ASS g\u00e9n\u00e9r\u00e9 : couleur, police, taille et contour. Le param\u00e9trage se fait dans un fichier de configuration XML situ\u00e9 \u00e0 l'int\u00e9rieur du jar.
subcli.config.unzip = Pour le modifier, il faut donc ouvrir le jar avec un gestionnaire d'archive et modifier le fichier user-config.xml :
subcli.config.xmlfile = Celui-ci se pr\u00e9sente comme suit :
subcli.config.howtoxml = Le bloc dualAssConfig configure les param\u00e8tres utilis\u00e9s par la commande --merge tandis que le bloc simpleAssConfig configure ceux de la commande --ass. Pour chacun la configuration est similaire et les valeurs possibles de chacune des balise sont les m\u00eames que sur le site (attention \u00e0 la police qui doit respecter la casse).

footer.viewOnGithub = View source on GitHub

sub.fontname = Font name
sub.fontname.mustBeInstalled = Font must be installed
sub.fontsize = Font size
sub.color = Color
sub.outlineColor = Outline color
sub.outline = Outline width
sub.filename = Filename
sub.filename.tooltip = ${top} / ${baseTop} /... will be replaced the filename
sub.invalid = Invalid file
sub.empty = Please select subtitles
sub.preview = The quick brown fox jumps over the lazy dog

validator.requiredField = Field is required
validator.exists.email = This email address is already used
validator.exists.username = This username address is already used
validator.invalid.email = Invalid email format
validator.invalid.username = Username can contain any letters or numbers, without spaces, and must be between 5 and 20 characters
validator.invalid.password = Password must be between 5 and 20 characters
validator.notsame.password = Password and password (Confirm) are not the same
validator.invalid.usernameOrPassword = Incorrect username or password
validator.invalid.color = Invalid color

error.unexpected = Unexpected error