appName = SubMerge

signIn = \u767b\u5f55
signIn.username = \u7528\u6237\u540d
signIn.password = \u5bc6\u7801
signIn.remember = \u4e0b\u6b21\u81ea\u52a8\u767b\u5f55
signIn.login = \u767b\u5f55

language = \u8bed\u8a00
language.french = \u6cd5\u8bed
language.english = \u82f1\u8bed
language.chinese = \u4e2d\u6587

index = \u9996\u9875
index.warningRegister = \u6ce8\u518c\u65b0\u5e10\u53f7 \u521b\u5efa\u548c\u7ba1\u7406\u5b57\u5e55\u4fe1\u606f
index.howToSaveSettings = \u5f53\u60a8\u70b9\u51fb\u4e0b\u8f7d\u6309\u94ae\u7684\u65f6\u5019\u60a8\u7684\u8bbe\u7f6e\u5c06\u4f1a\u81ea\u52a8\u4fdd\u5b58\u3002
index.topSubtitle = \u9876\u90e8\u5b57\u5e55
index.bottomSubtitle = \u5e95\u90e8\u5b57\u5e55
index.outputFile = \u8f93\u51fa\u6587\u4ef6
index.download = \u4e0b\u8f7d
index.choose = \u9009\u62e9

about = \u5173\u4e8e
about.submerge = \u5173\u4e8eSubMerge
about.howto.question = \u600e\u6837\u4f7f\u7528Submerge?
about.howto.answer = \u8bf7\u5148\u4e0a\u4f20\u4e24\u4e2a\u5b57\u5e55\u6587\u4ef6\uff0c\u7136\u540eSubmerge\u4f1a\u81ea\u52a8\u751f\u6210\u4e00\u4e2aSSA/ASS\u6587\u4ef6\uff0c\u6b64\u6587\u4ef6\u4f1a\u540c\u65f6\u663e\u793a\u5982\u4e0b\u56fe\u6240\u793a\u7684\u4e0a\u4e0b\u4e24\u4e2a\u5b57\u5e55\u3002
about.encoding.question = \u652f\u6301\u54ea\u4e9b\u5b57\u5e55\u683c\u5f0f?
about.encoding.answer = Submerge\u652f\u6301\u7684\u8f93\u5165\u5b57\u5e55\u683c\u5f0f\u6709SRT, SSA/ASS, \u53e6\u4f1a\u81ea\u52a8\u8bc6\u522b\u5b57\u7b26\u7f16\u7801\u683c\u5f0f\u3002\u751f\u6210\u7684\u8f93\u51fa\u6587\u4ef6\u683c\u5f0f\u662fASS, \u5b57\u7b26\u7f16\u7801\u683c\u5f0f\u662fUTF-8\u3002
about.fonts.question = \u5b57\u4f53\u7684\u6539\u53d8\u65e0\u6548\uff0c\u8bf7\u5148\u5b89\u88c5\u6b64\u5b57\u4f53
about.fonts.answer = \u5927\u90e8\u5206\u64ad\u653e\u5668\u652f\u6301ASS\u683c\u5f0f\uff0c\u4f46\u662f\u5b83\u4eec\u652f\u6301\u7684\u5b57\u4f53\u5e76\u4e0d\u591a\u3002\u6240\u4ee5\u6709\u7684\u65f6\u5019\u60a8\u5728\u6211\u4eec\u7684\u7f51\u7ad9\u4e0a\u9009\u62e9\u7684\u5b57\u4f53\u4e0d\u4e00\u5b9a\u4f1a\u6b63\u786e\u7684\u5728\u60a8\u7684\u64ad\u653e\u5668\u4e0a\u663e\u793a\uff0c\u8bf7\u60a8\u5148\u786e\u8ba4\u60a8\u7684\u64ad\u653e\u5668\u652f\u6301\u6b64\u5b57\u4f53\uff0c\u5982\u679c\u4e0d\u652f\u6301\u7684\u8bdd\uff0c\u60a8\u9700\u8981\u5148\u4ece\u7f51\u4e0a\u4e0b\u8f7d\u6b64\u5b57\u4f53\u3002
about.contact = \u8054\u7cfb\u6211\u4eec
about.contact.me = \u60a8\u53ef\u4ee5\u5728GitHub\u4e0a\u627e\u5230\u6e90\u4ee3\u7801\uff0c\u5982\u679c\u60a8\u53d1\u73b0bug\u6216\u8005\u6709\u4ec0\u4e48\u5efa\u8bae\u8bf7\u53ca\u65f6\u5728GitHub\u4e0a\u53cd\u9988\u3002\u53e6\u5982\u679c\u60a8\u8fd8\u6709\u5176\u4ed6\u95ee\u9898\u6216\u8005\u60f3\u8981\u628a\u8be5\u7f51\u7ad9\u7ffb\u8bd1\u6210\u522b\u7684\u8bed\u8a00\uff0c\u8bf7\u901a\u8fc7\u90ae\u4ef6\u8054\u7cfb\u6211\u3002
about.contact.at = \u8054\u7cfb\u65b9\u5f0f:
about.contact.sourcesAt = \u6e90\u4ee3\u7801:

logout = \u9000\u51fa

signUpOrLogin = \u6ce8\u518c / \u767b\u5f55
signUp = \u6ce8\u518c
signUp.username = \u7528\u6237\u540d
signUp.password = \u5bc6\u7801
signUp.passwordConfirm = \u786e\u8ba4\u5bc6\u7801
signUp.email = \u90ae\u7bb1
signUp.register = \u6ce8\u518c

tools = \u5de5\u5177
tools.convert = \u8f6c\u6362
tools.choose = \u9009\u62e9
tools.convertutf8 = \u8f6c\u6362\u6210UTF-8\u7f16\u7801\u683c\u5f0f
tools.convertutf8.explanation = \u8bc6\u522b\u7f16\u7801\u683c\u5f0f\u4ee5\u53ca\u5c06\u5176\u8f6c\u6362\u6210UTF-8
tools.convertsrt = \u8f6c\u6362\u6210SRT\u6587\u4ef6\u683c\u5f0f
tools.convertsrt.explanation = \u5c06SSA/ASS\u6587\u4ef6\u8f6c\u6362\u6210SRT\u683c\u5f0f
tools.convertass = \u8f6c\u6362\u6210ASS\u6587\u4ef6\u683c\u5f0f
tools.convertass.explanation = SRT/ASS\u6587\u4ef6\u8f6c\u6362\u6210ASS\u5b9a\u4e49\u683c\u5f0f
tools.cli = \u684c\u9762\u5e94\u7528
tools.appli.description = SubMerge\u4e5f\u53ef\u4ee5\u5e94\u7528\u4e8e\u4e00\u4e2a\u684c\u9762\u5e94\u7528(\u547d\u4ee4\u8bed\u53e5)
tools.appli.download = \u4e0b\u8f7dsubmerge-cli
tools.appli.howToUse = \u600e\u6837\u5e94\u7528submerge-cli\uff1f

subcli.downloadPage = Le fichier jar peut \u00eatre t\u00e9l\u00e9charg\u00e9 
subcli.downloadLink = ici
subcli.example = Exemple :
subcli.basicUse = Installation
subcli.basicUse.intro = submerge-cli est une application utilisable en ligne de commande proposant les m\u00eames fonctionnalit\u00e9s que le site : merge de 2 sous-titres en 1, modification de l'encodage de caract\u00e8re d'un fichier, g\u00e9n\u00e9ration de sous-titres ASS et conversion en SRT.
subcli.basicUse.jre.message = L'application est d\u00e9velopp\u00e9e en java. Elle est donc compatible linux / Mac / Windows mais requiert l'installation de 
subcli.basicUse.jre.link = Java Runtime Environment 8
subcli.basicUse.jre.version.windows = Pour conna\u00eetre sa version de java (windows) :
subcli.basicUse.jre.version.linux = Sous linux :
subcli.basicUse.jre.version.go = Si la version de java est ant\u00e9rieure \u00e0 8, il faut proc\u00e9der \u00e0 la mise \u00e0 jour. L'utilisation de submerge-cli ne requiert pas d'autre manipulation et il suffit alors d'ouvrir un terminal dans le dossier du jar et de tapper la commande d\u00e9sir\u00e9e. Par exemple afficher l'aide :
subcli.basicUse.linux.command = Pour transformer l'utilisation du jar en une commande syst\u00e8me (exemple ici sous linux), cr\u00e9er un fichier stub.sh dans le m\u00eame r\u00e9pertoire que le jar contenant le code suivant :
subcli.basicUse.createStub = Puis ex\u00e9cuter les commandes suivantes :
subcli.basicUse.example = D\u00e9sormais submerge peut \u00eatre lanc\u00e9 comme n'importe quelle commande (ici nomm\u00e9e sbm) :
subcli.merge = Merge
subcli.merge.intro = La commande merge prend 2 sous-titres au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un ASS dans le r\u00e9pertoire courant. Pour personnaliser le sous-titre g\u00e9n\u00e9r\u00e9, se r\u00e9f\u00e9rer \u00e0 l'onglet configuration.
subcli.merge.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output
subcli.merge.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.srt = SRT
subcli.srt.intro = La commande srt prend 2 sous-titres au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un SRT dans le r\u00e9pertoire courant. Si le sous-titre d'entr\u00e9e est un SSA / ASS alors les balises italique sont traduite en balise itaque SRT (tout autre formattage est effac\u00e9). 
subcli.srt.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output
subcli.srt.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.ass = ASS
subcli.ass.intro = La commande ass prend un sous-titre au format ASS ou SRT en entr\u00e9e et g\u00e9n\u00e8re un ASS formatt\u00e9 dans le r\u00e9pertoire courant. Pour personnaliser le sous-titre g\u00e9n\u00e9r\u00e9, se r\u00e9f\u00e9rer \u00e0 l'onglet configuration. 
subcli.ass.optionOutput = Il est possible de sp\u00e9cifier le nom du fichier g\u00e9n\u00e9r\u00e9 avec l'option --output :
subcli.ass.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.utf8 = UTF-8
subcli.utf8.intro = La commande utf8 accepte un fichier en entr\u00e9e (pas de restriction sur le format), elle en d\u00e9tecte l'encodage de caract\u00e8re et le transforme en UTF-8.
subcli.utf8.optionOutput = En l'absence d'autre param\u00e8tre, la commande utf8 modifie directement le fichier d'entr\u00e9e. Il est en cependant possible de laisser celui-ci tel quel et d'\u00e9crire le r\u00e9sultat dans un nouveau fichier via l'option --output
subcli.utf8.shortOptions = Chaque option peut \u00eatre abr\u00e9g\u00e9e par sa premi\u00e8re lettre :
subcli.config = Configuration
subcli.config.intro = Comme le site, submerge-cli permet de configurer les param\u00e8tres les plus courants du fichier ASS g\u00e9n\u00e9r\u00e9 : couleur, police, taille et contour. Le param\u00e9trage se fait dans un fichier de configuration XML situ\u00e9 \u00e0 l'int\u00e9rieur du jar.
subcli.config.unzip = Pour le modifier, il faut donc ouvrir le jar avec un gestionnaire d'archive et modifier le fichier user-config.xml :
subcli.config.xmlfile = Celui-ci se pr\u00e9sente comme suit :
subcli.config.howtoxml = Le bloc dualAssConfig configure les param\u00e8tres utilis\u00e9s par la commande --merge tandis que le bloc simpleAssConfig configure ceux de la commande --ass. Pour chacun la configuration est similaire et les valeurs possibles de chacune des balise sont les m\u00eames que sur le site (attention \u00e0 la police qui doit respecter la casse).


footer.viewOnGithub = GitHub\u6e90\u4ee3\u7801

sub.fontname = \u5b57\u4f53
sub.fontname.mustBeInstalled = \u5fc5\u987b\u5148\u5b89\u88c5\u6b64\u5b57\u4f53
sub.fontsize = \u5b57\u4f53\u5927\u5c0f
sub.color = \u989c\u8272
sub.outlineColor = \u5b57\u4f53\u8f6e\u5ed3\u989c\u8272
sub.outline = \u5b57\u4f53\u8f6e\u5ed3\u5927\u5c0f
sub.filename = \u6587\u4ef6\u540d
sub.filename.tooltip = ${top} / ${baseTop} /...  \u5c06\u4f1a\u91c7\u7528\u6307\u5b9a\u7684\u6587\u4ef6\u540d
sub.invalid = \u6587\u4ef6\u683c\u5f0f\u4e0d\u6b63\u786e
sub.empty = \u8bf7\u9009\u62e9\u5b57\u5e55
sub.preview = \u91c7\u83ca\u4e1c\u7bf1\u4e0b\uff0c \u60a0\u7136\u89c1\u5357\u5c71\u3002

validator.requiredField = \u5fc5\u586b\u9879
validator.exists.email = \u6b64\u90ae\u7bb1\u5730\u5740\u5df2\u88ab\u4f7f\u7528
validator.exists.username = \u6b64\u7528\u6237\u540d\u5df2\u88ab\u4f7f\u7528
validator.invalid.email = \u90ae\u7bb1\u683c\u5f0f\u4e0d\u6b63\u786e
validator.invalid.username = \u7528\u6237\u540d\u53ef\u4ee5\u5305\u542b\u4efb\u4f55\u5b57\u6bcd\u548c\u6570\u5b57\uff0c\u4e0d\u53ef\u5305\u542b\u7a7a\u683c\u3002\u957f\u5ea6\u5fc5\u987b\u57285\u548c20\u4e4b\u95f4\u3002
validator.invalid.password = \u5bc6\u7801\u957f\u5ea6\u5fc5\u987b\u57285\u548c20\u4e4b\u95f4
validator.invalid.usernameOrPassword = \u5bc6\u7801\u6216\u8005\u7528\u6237\u540d\u4e0d\u6b63\u786e
validator.invalid.color = \u989c\u8272\u683c\u5f0f\u4e0d\u6b63\u786e

error.unexpected = \u610f\u5916\u7684\u9519\u8bef